<?php

namespace App\Commons;

class MasterCommons
{
    // お店のタイプリスト
    public static $shop_types = [1 => 'チェーン店', 2 => 'のれん分け', 3 => '独自店', 4 => '不明'];
    // タグリスト
    public static $tags_category = [
        1 => 'ラーメン',
        2 => 'つけ麺',
        3 => 'まぜそば',
        4 => 'その他の麺',
        5 => '醤油系',
        6 => '味噌系',
        7 => '塩系',
        8 => '豚骨系',
        9 => '魚介系',
        10 => 'その他スープ',
    ];

    // 性別リスト
    public static $genders = [1 => '男性', 2 => '女性', 3 => '非公開'];

    // public static $ramen_category = [
    //     1 => 'ラーメン',
    //     2 => 'つけ麺',
    //     3 => 'まぜそば',
    //     4 => 'その他の麺',
    // ];

    // public static $soups = [
    //     1 => '醤油系',
    //     2 => '味噌系',
    //     3 => '塩系',
    //     4 => '豚骨系',
    //     5 => '魚介系',
    //     6 => 'その他スープ',
    // ];
}